---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaReinforcementCurve
source: html/27ce1b47-2fc2-447d-e995-8a6fd630b44b.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementCurve

An object that specifies the type of a floor in Autodesk Revit.

## Syntax (C#)
```csharp
public class AreaReinforcementCurve : CurveElement
```

## Remarks
The structural layers of the floor can be accessed via this object.